test/vcr_cassettes/payment_url_with_valid_credentials.json

[
  {
    "request": {
      "body": "{\"transaction[sendReminderEmail]\":\"0\",\"transaction[orderExchangeUrl]\":\"https://example.com/notify\",\"transaction[currency]\":\"EUR\",\"token\":\"TestToken\",\"testMode\":\"1\",\"serviceId\":\"TestService\",\"ipAddress\":\"127.0.0.1\",\"finishUrl\":\"https://example.com/return\",\"enduser[language]\":\"EN\",\"amount\":100}",
      "headers": {
        "content-type": "application/json"
      },
      "method": "post",
      "options": {
        "connect_timeout": 3000
      },
      "request_body": "",
      "url": "https://rest-api.pay.nl/v13/Transaction/start/json"
    },
    "response": {
      "body": "{\"request\":{\"result\":\"1\",\"errorId\":\"\",\"errorMessage\":\"\"},\"endUser\":{\"blacklist\":\"0\"},\"transaction\":{\"transactionId\":\"865264048X15d3f7\",\"paymentURL\":\"https:\\/\\/api.pay.nl\\/controllers\\/payments\\/issuer.php?orderId=865264048X15d3f7&entranceCode=a58ef3885b2092420cabac3effde5e59f9561c2b&profileID=613\",\"popupAllowed\":\"0\",\"paymentReference\":\"0000 0008 6526 4048\"}}",
      "headers": {
        "Date": "Tue, 15 Aug 2017 09:31:28 GMT",
        "Server": "Apache",
        "Set-Cookie": "device_id=617637ad98d1c978814143a019b090d5ee6444ee; expires=Wed, 15-Aug-2018 09:31:28 GMT; path=/; domain=.pay.nl; httponly",
        "Expires": "Mon, 26 Jul 1990 05:00:00 GMT",
        "Last-Modified": "Tue, 15 Aug 2017 09:31:28 GMT",
        "Cache-Control": "post-check=0, pre-check=0",
        "Pragma": "no-cache",
        "X-Frame-Options": "SAMEORIGIN",
        "X-XSS-Protection": "1; mode=block",
        "X-Content-Type-Options": "nosniff",
        "Content-Length": "360",
        "Connection": "close",
        "Content-Type": "application/json"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]
