test/vcr_cassettes/payment_url_with_valid_credentials_and_provider.json

[
  {
    "request": {
      "body": "{\"transaction[sendReminderEmail]\":\"0\",\"transaction[orderExchangeUrl]\":\"https://example.com/notify\",\"transaction[currency]\":\"EUR\",\"token\":\"TestToken\",\"testMode\":\"1\",\"serviceId\":\"TestService\",\"paymentOptionId\":10,\"ipAddress\":\"127.0.0.1\",\"finishUrl\":\"https://example.com/return\",\"enduser[language]\":\"EN\",\"amount\":100}",
      "headers": {
        "content-type": "application/json"
      },
      "method": "post",
      "options": {
        "connect_timeout": 3000
      },
      "request_body": "",
      "url": "https://rest-api.pay.nl/v13/Transaction/start/json"
    },
    "response": {
      "body": "{\"request\":{\"result\":\"1\",\"errorId\":\"\",\"errorMessage\":\"\"},\"endUser\":{\"blacklist\":\"0\"},\"transaction\":{\"transactionId\":\"865537486X9d7982\",\"paymentURL\":\"https:\\/\\/api.pay.nl\\/controllers\\/payments\\/issuer.php?orderId=865537486X9d7982&entranceCode=a37c7e83af484f05075ced26f863cd0934c9875d&profileID=613\",\"popupAllowed\":\"0\",\"paymentReference\":\"1000 0008 6553 7486\"}}",
      "headers": {
        "Date": "Wed, 16 Aug 2017 09:00:20 GMT",
        "Server": "Apache",
        "Set-Cookie": "device_id=056b4432a78d7fa6dde896fd02ca317061da139c; expires=Thu, 16-Aug-2018 09:00:20 GMT; path=/; domain=.pay.nl; httponly",
        "Expires": "Mon, 26 Jul 1990 05:00:00 GMT",
        "Last-Modified": "Wed, 16 Aug 2017 09:00:21 GMT",
        "Cache-Control": "post-check=0, pre-check=0",
        "Pragma": "no-cache",
        "X-Frame-Options": "SAMEORIGIN",
        "X-XSS-Protection": "1; mode=block",
        "X-Content-Type-Options": "nosniff",
        "Content-Length": "360",
        "Connection": "close",
        "Content-Type": "application/json"
      },
      "status_code": 200,
      "type": "ok"
    }
  }
]
